free-parking-new/app/controllers/games_controller.rb

  def index
    if params[:alphabet_sort]
      @games = Game.all.select { |a| a.name[0].upcase == params[:alphabet_sort] }
---
SELECT "games".* FROM "games"