app/helpers/application_helper.rb

  def current_user
    @current_user ||= User.find_by_id(session[:user_id]) if session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1